export const subjectNameIdMap = new Map<string, string>([
  ['アカデミックリテラシー', 'INT-1-A1-1030-001'],
  ['現代社会と数学', 'INT-1-A1-1030-002'],
  ['ITリテラシー', 'INT-1-A1-1030-003'],
  ['デジタルツールの使い方', 'INT-1-A1-0204-004'],
  ['人工知能活用実践', 'INT-1-A2-1234-005'],
  ['人文社会入門', 'INT-1-A1-1030-006'],
  ['経済入門', 'INT-1-A1-0204-007'],
  ['情報セキュリティ概論', 'BSC-1-B1-1030-001'],
  ['情報倫理と法', 'BSC-1-B1-0204-002'],
  ['データサイエンス概論', 'BSC-1-B1-0204-003'],
  ['数学的思考とは何か', 'BSC-1-B1-0204-004'],
  ['数学史', 'BSC-1-B1-1030-005'],
  ['現代社会とサイエンス', 'BSC-1-B1-0204-006'],
  ['日本文学Ⅰ', 'BSC-1-B1-1030-008'],
  ['文化人類学Ⅰ', 'BSC-1-B1-1030-009'],
  ['心理学', 'BSC-1-B1-0204-010'],
  ['社会学Ⅰ', 'BSC-1-B1-1030-011'],
  ['法学Ⅰ', 'BSC-1-B1-0204-012'],
  ['伝わる論理とコミュニケーション', 'BSC-1-B1-1030-013'],
  ['企業経営', 'BSC-1-B1-0204-014'],
  ['地域アントレプレナーシップ', 'BSC-1-B1-0204-015'],
  ['地域課題の解決とイノベーション', 'BSC-1-B1-0204-016'],
  ['多言語ITコミュニケーション', 'BSC-1-A2-1234-007'],
  ['ビジュアルプログラミング', 'INF-1-C1-1030-001'],
  ['Webアプリケーション開発1', 'INF-1-C1-1030-002'],
  ['Webアプリケーション開発2', 'INF-1-C1-0204-003'],
  ['Pythonプログラミング', 'INF-1-C1-0204-004'],
  ['Webユーザーエクスペリエンス', 'INF-1-C1-0204-005'],
  ['メディアアート史', 'INF-1-C1-0204-006'],
  ['統計学入門', 'INF-1-C1-1030-007'],
  ['ディープラーニング1', 'INF-1-C1-1030-008'],
  ['数学の方法', 'MTH-1-C1-0204-001'],
  ['逆さ科学史', 'MTH-1-C1-0204-002'],
  ['初等代数概論', 'MTH-1-C1-1030-003'],
  ['線形代数1', 'MTH-1-C1-1030-004'],
  ['解析学1', 'MTH-1-C1-0204-005'],
  ['線形代数2', 'MTH-1-C1-1030-006'],
  ['解析学2', 'MTH-1-C1-0204-007'],
  ['グラフ理論', 'MTH-1-C1-0204-008'],
  ['機械翻訳実践（英語読解・作文）', 'LAN-1-B1-1030-001'],
  ['世界が変わる編集力', 'HUM-1-C1-1030-001'],
  ['リテラシーと応⽤のための物語理論', 'HUM-1-C1-1030-002'],
  ['哲学概論', 'HUM-1-C1-0204-003'],
  ['公共哲学', 'HUM-1-C1-0204-004'],
  ['マンガ絵コンテから学ぶ視覚表現', 'HUM-1-C1-0204-005'],
  ['近・現代アート概論', 'HUM-1-C1-0204-006'],
  ['AI社会の歩き方', 'SOC-1-C2-1200-001'],
  ['地域研究', 'SOC-1-C1-0204-002'],
  ['意思決定の能力開発', 'SOC-1-C1-0204-003'],
  ['共創地球論', 'SOC-1-C1-0204-004'],
  ['情報社会の総合安全保障', 'SOC-1-C1-0204-005'],
  ['経済言説史', 'ECON-1-C1-1030-001'],
  ['マルクス経済学', 'ECON-1-C1-0204-002'],
  ['企業経営と会計', 'ECON-1-C1-1030-003'],
  ['IT産業史', 'DIGI-1-B1-1030-001'],
  ['マンガ産業史', 'DIGI-1-B1-1030-002'],
  ['アニメ産業史', 'DIGI-1-B1-0204-003'],
  ['日本のゲーム産業史', 'DIGI-1-B1-0204-004'],
  ['二次創作の歴史から見るネット文化', 'DIGI-1-C2-0034-005'],
  ['キャリアデザインⅠ（自己理解）', 'CAR-1-C1-0204-001'],
  ['英語コミュニケーションⅠ（発音）', 'CAR-1-C1-1030-002'],
  ['英語コミュニケーションⅡ（日常会話）', 'CAR-1-C1-0204-003'],
  ['対人コミュニケーション論', 'CAR-1-C1-0204-004'],
  ['クリエイティブ現場論', 'CAR-1-C2-1200-005'],
  ['ソーシャルイノベーション概論', 'CAR-1-C2-1200-006'],
  ['ネット情報発信概論', 'CAR-1-C2-0034-007'],
  ['デジタル画像技法論Ⅰ', 'CAR-1-C1-1030-008'],
  ['デジタル画像技法論Ⅱ', 'CAR-1-C1-1030-009'],
  ['デジタル画像技法論Ⅲ', 'CAR-1-C1-0204-010'],
  ['情報収集と伝達技術', 'INF-1-C3-0034-009'],
  ['数理科学発展演習Ⅰ', 'MTH-1-C3-0034-009'],
  ['Inter-universal Teichmüller Theory 1（宇宙際タイヒミューラー理論 1）', 'MTH-1-C3-0034-010'],
  ['生きてゆくための禅', 'HUM-1-C3-0034-007'],
  ['政治を超える哲学Ⅰ', 'HUM-1-C3-0034-008'],
  ['イラストとエンタテインメントA', 'OPT-1-D1-1030-001'],
  ['イラストとエンタテインメントB', 'OPT-1-D1-1030-002'],
  ['イラストとエンタテインメントC', 'OPT-1-D1-0204-003'],
  ['イラストとエンタテインメントD', 'OPT-1-D1-0204-004'],
  ['インターネット概論', 'INF-2-C1-1030-001'],
  ['プロジェクトマネジメント概論', 'INF-2-C1-1030-002'],
  ['Webアプリケーション開発3', 'INF-2-C1-1030-003'],
  ['Linux概論', 'INF-2-C1-1030-004'],
  ['オブジェクト指向プログラミング', 'INF-2-C1-1030-005'],
  ['コンピューターサイエンス概論', 'INF-2-C1-1030-006'],
  ['JavaScriptによる自動化、効率化', 'INF-2-C1-0204-007'],
  ['情報処理概論', 'INF-2-C1-0204-008'],
  ['コンピュータ概論', 'INF-2-C1-0204-009'],
  ['Webアプリケーション開発4', 'INF-2-C1-0204-010'],
  ['機械学習概論', 'INF-2-C1-1030-011'],
  ['計算機実験で学ぶ確率とモンテカルロ法', 'INF-2-C1-1030-012'],
  ['ディープラーニング2', 'INF-2-C1-1030-013'],
  ['ビッグデータ分析概論', 'INF-2-C1-1030-014'],
  ['R言語プログラミング', 'INF-2-C1-0204-015'],
  ['数理構造の発見と活用', 'MTH-2-C1-0204-001'],
  ['集合と論理', 'MTH-2-C1-1030-002'],
  ['記号論理', 'MTH-2-C1-0204-003'],
  ['解析学3', 'MTH-2-C1-1030-004'],
  ['距離空間', 'MTH-2-C1-1030-005'],
  ['複素解析', 'MTH-2-C1-1030-006'],
  ['日常に現れる物理学', 'MTH-2-C1-0204-007'],
    ['力学', 'MTH-2-C1-1030-008'],
  ['機械翻訳実践（法学）', 'LAN-2-B2-1200-001'],
  ['機械翻訳実践（情報）', 'LAN-2-B2-1200-002'],
  ['機械翻訳実践（異文化理解）', 'LAN-2-B2-0034-003'],
  ['機械翻訳実践（自然科学）', 'LAN-2-B2-0034-004'],
  ['機械翻訳実践（日本研究）', 'LAN-2-B2-0034-005'],
  ['認知神経科学', 'HUM-2-C1-1030-001'],
  ['科学哲学', 'HUM-2-C1-1030-002'],
  ['人新世の人類学', 'HUM-2-C1-1030-003'],
  ['日本文学Ⅱ', 'HUM-2-C1-0204-004'],
  ['文化人類学Ⅱ', 'HUM-2-C1-0204-005'],
  ['民俗学', 'HUM-2-C1-0204-006'],
  ['日本科学史', 'HUM-2-C1-0204-007'],
  ['芸術と文化資本Ⅰ', 'HUM-2-C1-0204-008'],
  ['ネット時代の著作権', 'SOC-2-C2-1200-001'],
  ['ジェンダー論', 'SOC-2-C1-1030-002'],
  ['メディア論', 'SOC-2-C1-1030-003'],
  ['科学技術と社会', 'SOC-2-C1-1030-004'],
  ['情報社会論', 'SOC-2-C1-1030-005'],
  ['戦後日本史1', 'SOC-2-C1-1030-006'],
  ['異文化理解', 'SOC-2-C1-1030-007'],
  ['大学とメディアの人類史', 'SOC-2-C1-1030-008'],
  ['社会学Ⅱ', 'SOC-2-C1-0204-009'],
  ['マクロ経済学', 'ECON-2-C1-1030-001'],
  ['ミクロ経済学', 'ECON-2-C1-0204-002'],
  ['企業経営とファイナンス', 'ECON-2-C1-0204-003'],
  ['デジタル・マーケティング', 'ECON-2-C1-0204-004'],
  ['スタートアップ', 'ECON-2-C1-0204-005'],
  ['農業とデジタルテクノロジー', 'ECON-2-C1-0204-006'],
  ['交渉・合意形成概論', 'ECON-2-C1-0204-007'],
  ['コンテンツ産業論', 'DIGI-2-C1-1030-001'],
  ['ゲーム制作論基礎', 'DIGI-2-C1-1030-002'],
  ['キャリアデザインⅡ（仕事理解）', 'CAR-2-C1-1030-001'],
  ['キャリアデザインⅢ（就活実践）', 'CAR-2-C1-0204-002'],
  ['人生設計とお金の管理', 'CAR-2-C1-0204-003'],
  ['ネットワーク産業論', 'CAR-2-C2-1200-004'],
  ['デジタル画像創作論Ⅰ', 'CAR-2-C1-1030-005'],
  ['デジタル画像創作論Ⅱ', 'CAR-2-C1-0204-006'],
  ['デジタル画像創作論Ⅲ', 'CAR-2-C1-0204-007'],
  ['3Dモデリング技術演習', 'INF-2-C3-1200-016'],
  ['ジェネラティブアート演習', 'INF-2-C3-1200-017'],
  ['インターネットのしくみ', 'INF-2-C3-0034-018'],
  ['Javaプログラミング演習', 'INF-2-C3-0034-019'],
  ['Webセキュリティ演習', 'INF-2-C3-0034-020'],
  ['デジタルイラスト演習基礎', 'INF-2-C3-0034-021'],
  ['AIアルゴリズム実践', 'INF-2-C3-0034-022'],
  ['統計学展望', 'INF-2-C3-1200-023'],
  ['マーケティング × データサイエンス', 'INF-2-C3-0034-024'],
  ['数理科学発展演習Ⅱ', 'MTH-2-C3-1200-009'],
  ['Inter-universal Teichmüller Theory 2（宇宙際タイヒミューラー理論 2）', 'MTH-2-C3-1200-010'],
  ['Inter-universal Teichmüller Theory 3（宇宙際タイヒミューラー理論 3）', 'MTH-2-C3-0034-011'],
  ['政治を超える哲学Ⅱ', 'HUM-2-C3-1200-009'],
  ['社会で活きる囲碁論', 'HUM-2-C3-1200-010'],
  ['心理学実験・調査演習', 'HUM-2-C3-1200-011'],
  ['WEBコミック演習', 'HUM-2-C3-0034-012'],
  ['こころの成り立ちとメンタルヘルス', 'HUM-2-C3-0034-013'],
  ['ウェルビーイングをデザインする', 'HUM-2-C3-0034-014'],
  ['社会学Ⅲ', 'SOC-2-C3-1200-010'],
  ['現代スポーツ構造分析', 'SOC-2-C3-1200-011'],
  ['SFから考える未来ビジョン', 'SOC-2-C3-1200-012'],
  ['現代社会理論', 'SOC-2-C3-0034-013'],
  ['未来社会デザイン論', 'SOC-2-C3-0034-014'],
  ['音楽と社会', 'SOC-2-C3-0034-015'],
  ['子どもと地域づくり', 'SOC-2-C3-0034-016'],
  ['コラボレーション・クリエイティブ', 'SOC-2-C3-0034-017'],
  ['現代資本主義論', 'ECON-2-C3-0034-008'],
  ['メディアで検証する未来の作り方', 'DIGI-2-C3-1200-003'],
  ['アニメのクオリティー管理と商品性', 'DIGI-2-C3-1200-004'],
  ['マンガの企画立案とプロデュース論', 'DIGI-2-C3-0034-005'],
  ['文化資源とメタバース', 'DIGI-2-C3-1200-006'],
  ['文化資源のデジタルアーカイブ', 'DIGI-2-C3-0034-007'],
  ['英語コミュニケーションⅢ（プレゼンテーション）', 'CAR-2-C3-1234-008'],
  ['英語コミュニケーションⅣ（ビジネス会話）', 'CAR-2-C3-1234-009'],
  ['デジタルトランスフォーメーション時代の働き方', 'CAR-2-C3-1200-010'],
  ['生命科学論ー動的平衡の視点から「生命とはなにか」を哲学するー', 'HUM-2-C1-0204-009'],
  ['日本政治外交史', 'SOC-2-C1-0204-010'],
  ['イラストとデザインA', 'OPT-2-D1-1030-001'],
  ['イラストとデザインB', 'OPT-2-D1-1030-002'],
  ['イラストとデザインC', 'OPT-2-D1-1030-003'],
  ['イラストとデザインD', 'OPT-2-D1-0204-004'],
  ['クラウドコンピューティング技術', 'INF-3-C1-1030-001'],
  ['関数型プログラミング', 'INF-3-C1-1030-002'],
  ['オートマトンと形式言語理論', 'INF-3-C1-1030-003'],
  ['暗号技術とその応用', 'INF-3-C1-1030-004'],
  ['データベース運用実践', 'INF-3-C1-0204-005'],
  ['並行処理プログラミング', 'INF-3-C1-0204-006'],
  ['画像処理論', 'INF-3-C1-0204-007'],
  ['論理回路概論', 'INF-3-C1-0204-008'],
  ['データサイエンス実践Ⅰ（アンケート）', 'INF-3-C1-1030-009'],
  ['データサイエンス実践Ⅱ（モデリング）', 'INF-3-C1-1030-010'],
  ['データサイエンス実践Ⅲ（時系列）', 'INF-3-C1-0204-011'],
  ['ディープラーニング3', 'INF-3-C1-1030-012'],
  ['ビッグデータ分析実践', 'INF-3-C1-1030-013'],
  ['群論', 'MTH-3-C1-1030-001'],
  ['位相空間', 'MTH-3-C1-0204-002'],
  ['多様体', 'MTH-3-C1-0204-003'],
  ['圏論', 'MTH-3-C1-1030-004'],
  ['数理統計', 'MTH-3-C1-0204-005'],
  ['電磁気学', 'MTH-3-C1-1030-006'],
  ['量子力学', 'MTH-3-C1-0204-007'],
    ['熱統計力学', 'MTH-3-C1-0204-008'],
  ['統計学を哲学する', 'HUM-3-C1-1030-001'],
  ['日本大衆文化史', 'HUM-3-C1-1030-002'],
  ['法学Ⅱ', 'SOC-3-C1-1030-001'],
  ['戦後日本史2', 'SOC-3-C1-0204-002'],
  ['ゲーム制作論応用', 'DIGI-3-C1-1030-001'],
  ['デジタル画像活用Ⅰ', 'CAR-3-C1-1030-001'],
  ['デジタル画像活用Ⅱ', 'CAR-3-C1-0204-002'],
  ['ゲームプログラミング演習', 'INF-3-C3-1200-014'],
  ['チームプログラミング演習', 'INF-3-C3-1200-015'],
  ['プロジェクトマネジメント応用', 'INF-3-C3-1200-016'],
  ['Webアプリケーション開発演習', 'INF-3-C3-0034-017'],
  ['動画クリエイター技術演習', 'INF-3-C3-1200-018'],
  ['Webデザイン演習', 'INF-3-C3-1200-019'],
  ['デジタルイラスト演習発展', 'INF-3-C3-1200-020'],
  ['共創場デザイン演習', 'INF-3-C3-0034-021'],
  ['統計数理の方法', 'INF-3-C3-0034-022'],
  ['自然言語処理の方法', 'INF-3-C3-1200-023'],
  ['ゼミ（インターネットのしくみ（応用））', 'INF-3-C4-1234-024'],
  ['ゼミ（質的データ分析&エージェントシミュレーション）', 'INF-3-C4-1234-025'],
  ['ゼミ（情報セキュリティ）', 'INF-3-C4-1234-026'],
  ['ゼミ（AIデータサイエンス価値創造ゼミⅠ）', 'INF-3-C4-1234-027'],
  ['ゼミ（AIデータサイエンス価値創造ゼミⅡ）', 'INF-3-C4-1234-028'],
  ['環論', 'MTH-3-C3-0034-009'],
  ['組合せ論', 'MTH-3-C3-1200-010'],
  ['トポロジー', 'MTH-3-C3-0034-011'],
  ['積分と測度', 'MTH-3-C3-1200-012'],
  ['Inter-universal Teichmüller Theory 4（宇宙際タイヒミューラー理論 4）', 'MTH-3-C3-1200-013'],
  ['量子コンピュータ演習', 'MTH-3-C3-0034-014'],
  ['Wolfram言語で学ぶ科学計算', 'MTH-3-C3-1200-015'],
  ['芸術と文化資本Ⅱ', 'HUM-3-C3-1200-003'],
  ['日本文学Ⅲ', 'HUM-3-C3-1200-004'],
  ['文化人類学Ⅲ', 'HUM-3-C3-0034-005'],
  ['AI時代の科学と哲学', 'HUM-3-C3-0034-006'],
  ['フィールドワークで学ぶ宗教思想史', 'HUM-3-C3-0034-007'],
  ['ゼミ（心の科学）', 'HUM-3-C4-1234-008'],
  ['ゼミ（物語創作と物語の構造分析）', 'HUM-3-C4-1234-009'],
  ['ゼミ（トークイベントをつくる）', 'HUM-3-C4-1234-010'],
  ['スマート田舎のススメ', 'SOC-3-C3-0034-003'],
  ['課題解決と改革のリーダーシップ', 'SOC-3-C3-0034-004'],
  ['民主主義論', 'SOC-3-C3-0034-005'],
  ['ゼミ（多様化する家族）', 'SOC-3-C4-1234-007'],
  ['ゼミ（情報社会の政治学）', 'SOC-3-C4-1234-008'],
  ['マクロ経済分析演習', 'ECON-3-C3-0034-001'],
  ['課題解決のための計量経済分析', 'ECON-3-C3-0034-002'],
  ['事例から学ぶ統計学', 'ECON-3-C3-1200-003'],
  ['財務分析演習', 'ECON-3-C3-1200-004'],
  ['企業価値創造とM＆A', 'ECON-3-C3-0034-005'],
  ['交渉・合意形成演習', 'ECON-3-C3-0034-006'],
  ['ゼミ（地域づくり新事業ワークショップ）', 'ECON-3-C4-1234-007'],
  ['ゼミ（文化資源アーカイブとメタバース）', 'DIGI-3-C4-1234-002'],
  ['ゼミ（アニメ作品の分析メソッド）', 'DIGI-3-C4-1234-003'],
  ['アニメ産業に関わる仕事', 'CAR-3-C3-0034-003'],
  ['イラストとその活用A', 'OPT-3-D1-1030-001'],
  ['イラストとその活用B', 'OPT-3-D1-1030-002'],
  ['イラストとその活用C', 'OPT-3-D1-0204-003'],
  ['イラストとその活用D', 'OPT-3-D1-0204-004'],
  ['ゼミ（メディアアート）', 'INF-4-C4-1234-001'],
  ['ガロア理論', 'MTH-4-C3-1200-001'],
  ['数理論理学', 'MTH-4-C3-1200-002'],
  ['量子からはじまる確率論', 'MTH-4-C3-0034-003'],
  ['ゼミ（数理科学特論ゼミⅠ）', 'MTH-4-C4-1234-004'],
  ['ゼミ（数理科学特論ゼミⅡ）', 'MTH-4-C4-1234-005'],
  ['ゼミ（数理科学特論ゼミⅢ）', 'MTH-4-C4-1234-006'],
  ['ゼミ（数理科学特論ゼミⅣ）', 'MTH-4-C4-1234-007'],
  ['ゼミ（量子科学技術）', 'MTH-4-C4-1234-008'],
  ['ゼミ（展覧会のつくりかた）', 'HUM-4-C4-1234-001'],
  ['ゼミ（文芸批評論）', 'HUM-4-C4-1234-002'],
  ['ゼミ（ファン文化論を捉えなおすための参加型文化論）', 'HUM-4-C4-1234-003'],
  ['ゼミ（数理哲学）', 'HUM-4-C4-1234-004'],
  ['国際関係論', 'SOC-4-C3-1200-001'],
  ['ゼミ（社会学）', 'SOC-4-C4-1234-003'],
  ['ゼミ（意思決定研究と実践）', 'SOC-4-C4-1234-005'],
  ['ゼミ（異文化理解）', 'SOC-4-C4-1234-006'],
  ['スタートアップ実践', 'ECON-4-C3-0034-001'],
  ['ゼミ（ビジネスモデル分析）', 'ECON-4-C4-1234-002'],
  ['ゼミ（経済発展を考える）', 'ECON-4-C4-1234-003'],
  ['ゼミ（計量経済）', 'ECON-4-C4-1234-004'],
  ['ゼミ（幸福曲線）', 'ECON-4-C4-1234-005'],
  ['プロジェクト実践', 'PRJ-4-A3-1234-001'],
]);

export class SubjectDetailByName {

  name: string;
  highlyRecommendedPrerequisiteNames: string[];
  recommendedPrerequisiteNames: string[];
  recommendedSuccessorNames: string[];

  constructor(
    name: string,
    highlyRecommendedPrerequisiteNames: string[],
    recommendedPrerequisiteNames: string[],
    recommendedSuccessorNames: string[]
  ) {
    this.name = name;
    this.highlyRecommendedPrerequisiteNames = highlyRecommendedPrerequisiteNames;
    this.recommendedPrerequisiteNames = recommendedPrerequisiteNames;
    this.recommendedSuccessorNames = recommendedSuccessorNames;
  }

}

export const subjectDetailsByName: SubjectDetailByName[] = [
  new SubjectDetailByName(
    'アカデミックリテラシー',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '現代社会と数学',
    [],
    [],
    ['ITリテラシー', '人工知能活用実践', 'データサイエンス概論', '数学的思考とは何か', '数学史', '現代社会とサイエンス', '数学の方法']
  ),
  new SubjectDetailByName(
    'ITリテラシー',
    [],
    [],
    ['情報セキュリティ概論', '情報倫理と法', 'データサイエンス概論', 'インターネット概論', 'コンピュータ概論']
  ),
  new SubjectDetailByName(
    'デジタルツールの使い方',
    [],
    [],
    ['情報セキュリティ概論', '情報倫理と法', 'データサイエンス概論', '多言語ITコミュニケーション', '動画クリエイター技術演習', 'Webデザイン演習']
  ),
  new SubjectDetailByName(
    '人工知能活用実践',
    [],
    [],
    ['情報セキュリティ概論', '情報倫理と法', 'データサイエンス概論', '多言語ITコミュニケーション']
  ),
  new SubjectDetailByName(
    '人文社会入門',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '経済入門',
    [],
    [],
    ['企業経営', '地域アントレプレナーシップ', '地域課題の解決とイノベーション', 'マクロ経済学', 'ミクロ経済学']
  ),
  new SubjectDetailByName(
    '情報セキュリティ概論',
    [],
    ['ITリテラシー'],
    []
  ),
  new SubjectDetailByName(
    '情報倫理と法',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'データサイエンス概論',
    [],
    ['ITリテラシー'],
    ['統計学入門', '機械学習概論']
  ),
  new SubjectDetailByName(
    '数学的思考とは何か',
    [],
    ['現代社会と数学'],
    ['線形代数1', '解析学1', '位相空間']
  ),
  new SubjectDetailByName(
    '数学史',
    [],
    ['現代社会と数学'],
    ['逆さ科学史']
  ),
  new SubjectDetailByName(
    '現代社会とサイエンス',
    [],
    ['現代社会と数学'],
    ['逆さ科学史', '日常に現れる物理学']
  ),
  new SubjectDetailByName(
    '日本文学Ⅰ',
    [],
    [],
    ['日本文学Ⅱ']
  ),
  new SubjectDetailByName(
    '文化人類学Ⅰ',
    [],
    [],
    ['文化人類学Ⅱ']
  ),
  new SubjectDetailByName(
    '心理学',
    [],
    [],
    ['認知神経科学']
  ),
  new SubjectDetailByName(
    '社会学Ⅰ',
    [],
    [],
    ['社会学Ⅱ']
  ),
  new SubjectDetailByName(
    '法学Ⅰ',
    [],
    [],
    ['法学Ⅱ']
  ),
  new SubjectDetailByName(
    '伝わる論理とコミュニケーション',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '企業経営',
    [],
    [],
    ['企業経営と会計', '企業経営とファイナンス']
  ),
  new SubjectDetailByName(
    '地域アントレプレナーシップ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '地域課題の解決とイノベーション',
    [],
    [],
    ['スマート田舎のススメ', '農業とデジタルテクノロジー']
  ),
  new SubjectDetailByName(
    '多言語ITコミュニケーション',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ビジュアルプログラミング',
    [],
    [],
    ['Pythonプログラミング']
  ),
  new SubjectDetailByName(
    'Webアプリケーション開発1',
    [],
    [],
    ['Webアプリケーション開発2']
  ),
  new SubjectDetailByName(
    'Webアプリケーション開発2',
    [],
    ['Webアプリケーション開発1'],
    ['Webアプリケーション開発3']
  ),
  new SubjectDetailByName(
    'Pythonプログラミング',
    [],
    ['ビジュアルプログラミング'],
    []
  ),
  new SubjectDetailByName(
    'Webユーザーエクスペリエンス',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'メディアアート史',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '統計学入門',
    [],
    ['データサイエンス概論', '解析学1'],
    ['機械学習概論', 'R言語プログラミング', '数理統計']
  ),
  new SubjectDetailByName(
    'ディープラーニング1',
    [],
    ['データサイエンス概論', 'Pythonプログラミング', '線形代数1', '解析学1'],
    ['ディープラーニング2']
  ),
  new SubjectDetailByName(
    '数学の方法',
    [],
    [],
    ['線形代数1', '解析学1']
  ),
  new SubjectDetailByName(
    '逆さ科学史',
    [],
    [],
    ['数学史', '日常に現れる物理学']
  ),
  new SubjectDetailByName(
    '初等代数概論',
    [],
    [],
    ['群論']
  ),
  new SubjectDetailByName(
    '線形代数1',
    [],
    ['数学の方法'],
    ['線形代数2', '数理科学発展演習Ⅰ', '量子コンピュータ演習']
  ),
  new SubjectDetailByName(
    '解析学1',
    [],
    ['数学の方法'],
    ['解析学2', '数理科学発展演習Ⅰ', '力学']
  ),
  new SubjectDetailByName(
    '線形代数2',
    ['線形代数1'],
    [],
    ['解析学3', '数理科学発展演習Ⅱ', '量子力学']
  ),
  new SubjectDetailByName(
    '解析学2',
    ['解析学1'],
    [],
    ['解析学3', '距離空間', '数理科学発展演習Ⅱ', '電磁気学', '量子力学', '熱統計力学']
  ),
  new SubjectDetailByName(
    'グラフ理論',
    [],
    [],
    ['組合せ論']
  ),
  new SubjectDetailByName(
    '機械翻訳実践（英語読解・作文）',
    [],
    [],
    ['機械翻訳実践（法学）', '機械翻訳実践（情報）', '機械翻訳実践（異文化理解）', '機械翻訳実践（自然科学）', '機械翻訳実践（日本研究）']
  ),
  new SubjectDetailByName(
    '世界が変わる編集力',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'リテラシーと応⽤のための物語理論',
    [],
    [],
    ['ゼミ（物語創作と物語の構造分析）']
  ),
  new SubjectDetailByName(
    '哲学概論',
    [],
    [],
    ['科学哲学']
  ),
  new SubjectDetailByName(
    '公共哲学',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'マンガ絵コンテから学ぶ視覚表現',
    [],
    [],
    ['WEBコミック演習']
  ),
  new SubjectDetailByName(
    '近・現代アート概論',
    [],
    [],
    ['芸術と文化資本Ⅰ']
  ),
  new SubjectDetailByName(
    'AI社会の歩き方',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '地域研究',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '意思決定の能力開発',
    [],
    [],
    ['ゼミ（意思決定研究と実践）', '交渉・合意形成概論', '交渉・合意形成演習']
  ),
  new SubjectDetailByName(
    '共創地球論',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '情報社会の総合安全保障',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '経済言説史',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'マルクス経済学',
    [],
    [],
    ['現代資本主義論']
  ),
  new SubjectDetailByName(
    '企業経営と会計',
    [],
    ['企業経営'],
    ['企業経営とファイナンス']
  ),
  new SubjectDetailByName(
    'IT産業史',
    [],
    [],
    ['メディアで検証する未来の作り方']
  ),
  new SubjectDetailByName(
    'マンガ産業史',
    [],
    [],
    ['マンガの企画立案とプロデュース論']
  ),
  new SubjectDetailByName(
    'アニメ産業史',
    [],
    [],
    ['アニメのクオリティー管理と商品性', 'ゼミ（アニメ作品の分析メソッド）', 'アニメ産業に関わる仕事']
  ),
  new SubjectDetailByName(
    '日本のゲーム産業史',
    [],
    [],
    ['ゲーム制作論基礎', 'ゲーム制作論応用']
  ),
  new SubjectDetailByName(
    '二次創作の歴史から見るネット文化',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'キャリアデザインⅠ（自己理解）',
    [],
    [],
    ['キャリアデザインⅡ（仕事理解）']
  ),
  new SubjectDetailByName(
    '英語コミュニケーションⅠ（発音）',
    [],
    [],
    ['英語コミュニケーションⅢ（プレゼンテーション）', '英語コミュニケーションⅣ（ビジネス会話）']
  ),
  new SubjectDetailByName(
    '英語コミュニケーションⅡ（日常会話）',
    [],
    ['英語コミュニケーションⅠ（発音）'],
    ['英語コミュニケーションⅢ（プレゼンテーション）', '英語コミュニケーションⅣ（ビジネス会話）']
  ),
  new SubjectDetailByName(
    '対人コミュニケーション論',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'クリエイティブ現場論',
    [],
    ['対人コミュニケーション論'],
    []
  ),
  new SubjectDetailByName(
    'ソーシャルイノベーション概論',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ネット情報発信概論',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'デジタル画像技法論Ⅰ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'デジタル画像技法論Ⅱ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'デジタル画像技法論Ⅲ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '情報収集と伝達技術',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '数理科学発展演習Ⅰ',
    [],
    ['線形代数1', '線形代数2', '解析学1', '解析学2'],
    []
  ),
  new SubjectDetailByName(
    'Inter-universal Teichmüller Theory 1（宇宙際タイヒミューラー理論 1）',
    [],
    [],
    ['Inter-universal Teichmüller Theory 2（宇宙際タイヒミューラー理論 2）']
  ),
  new SubjectDetailByName(
    '生きてゆくための禅',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '政治を超える哲学Ⅰ',
    [],
    [],
    ['政治を超える哲学Ⅱ']
  ),
  new SubjectDetailByName(
    'イラストとエンタテインメントA',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとエンタテインメントB',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとエンタテインメントC',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとエンタテインメントD',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'インターネット概論',
    [],
    ['ITリテラシー'],
    []
  ),
  new SubjectDetailByName(
    'プロジェクトマネジメント概論',
    [],
    [],
    ['プロジェクトマネジメント応用']
  ),
  new SubjectDetailByName(
    'Webアプリケーション開発3',
    [],
    ['Webアプリケーション開発2'],
    ['Webアプリケーション開発4']
  ),
  new SubjectDetailByName(
    'Linux概論',
    [],
    ['Webアプリケーション開発4'],
    []
  ),
  new SubjectDetailByName(
    'オブジェクト指向プログラミング',
    [],
    ['Webアプリケーション開発4'],
    ['関数型プログラミング']
  ),
  new SubjectDetailByName(
    'コンピューターサイエンス概論',
    [],
    ['ITリテラシー', 'Pythonプログラミング'],
    ['オートマトンと形式言語理論']
  ),
  new SubjectDetailByName(
    'JavaScriptによる自動化、効率化',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '情報処理概論',
    [],
    ['ITリテラシー'],
    []
  ),
  new SubjectDetailByName(
    'コンピュータ概論',
    [],
    ['ITリテラシー'],
    []
  ),
  new SubjectDetailByName(
    'Webアプリケーション開発4',
    [],
    ['Webアプリケーション開発3'],
    []
  ),
  new SubjectDetailByName(
    '機械学習概論',
    [],
    ['データサイエンス概論', 'Pythonプログラミング'],
    ['AIアルゴリズム実践']
  ),
  new SubjectDetailByName(
    '計算機実験で学ぶ確率とモンテカルロ法',
    [],
    ['R言語プログラミング', '数学の方法', '解析学1'],
    []
  ),
  new SubjectDetailByName(
    'ディープラーニング2',
    [],
    ['ディープラーニング1'],
    ['ディープラーニング3']
  ),
  new SubjectDetailByName(
    'ビッグデータ分析概論',
    [],
    ['データサイエンス概論'],
    ['ビッグデータ分析実践']
  ),
  new SubjectDetailByName(
    'R言語プログラミング',
    [],
    ['データサイエンス概論', '統計学入門'],
    []
  ),
  new SubjectDetailByName(
    '数理構造の発見と活用',
    [],
    ['数学的思考とは何か', '集合と論理'],
    ['数理科学発展演習Ⅱ', '圏論']
  ),
  new SubjectDetailByName(
    '集合と論理',
    [],
    ['線形代数2'],
    ['記号論理', '距離空間', '数理構造の発見と活用', '数理科学発展演習Ⅱ', '位相空間']
  ),
  new SubjectDetailByName(
    '記号論理',
    [],
    ['集合と論理'],
    ['数理論理学']
  ),
  new SubjectDetailByName(
    '解析学3',
    ['解析学2'],
    [],
    ['複素解析', '電磁気学']
  ),
  new SubjectDetailByName(
    '距離空間',
    ['集合と論理'],
    [],
    ['数理科学発展演習Ⅱ', '位相空間', '積分と測度']
  ),
  new SubjectDetailByName(
    '複素解析',
    [],
    ['解析学3'],
    []
  ),
  new SubjectDetailByName(
    '日常に現れる物理学',
    [],
    [],
    ['力学', '電磁気学']
  ),
  new SubjectDetailByName(
    '力学',
    [],
    ['解析学1', '日常に現れる物理学'],
    ['電磁気学', '熱統計力学']
  ),
  new SubjectDetailByName(
    '機械翻訳実践（法学）',
    [],
    ['多言語ITコミュニケーション', '機械翻訳実践（英語読解・作文）'],
    []
  ),
  new SubjectDetailByName(
    '機械翻訳実践（情報）',
    [],
    ['多言語ITコミュニケーション', '機械翻訳実践（英語読解・作文）'],
    []
  ),
  new SubjectDetailByName(
    '機械翻訳実践（異文化理解）',
    [],
    ['多言語ITコミュニケーション', '機械翻訳実践（英語読解・作文）'],
    ['異文化理解', 'ゼミ（異文化理解）']
  ),
  new SubjectDetailByName(
    '機械翻訳実践（自然科学）',
    [],
    ['多言語ITコミュニケーション', '機械翻訳実践（英語読解・作文）'],
    []
  ),
  new SubjectDetailByName(
    '機械翻訳実践（日本研究）',
    [],
    ['多言語ITコミュニケーション', '機械翻訳実践（英語読解・作文）'],
    ['ゼミ（文芸批評論）']
  ),
  new SubjectDetailByName(
    '認知神経科学',
    [],
    ['心理学'],
    []
  ),
  new SubjectDetailByName(
    '科学哲学',
    [],
    ['哲学概論'],
    ['統計学を哲学する', 'AI時代の科学と哲学']
  ),
  new SubjectDetailByName(
    '人新世の人類学',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '日本文学Ⅱ',
    [],
    ['日本文学Ⅰ'],
    ['日本文学Ⅲ']
  ),
  new SubjectDetailByName(
    '文化人類学Ⅱ',
    [],
    ['文化人類学Ⅰ'],
    []
  ),
  new SubjectDetailByName(
    '民俗学',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '日本科学史',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '芸術と文化資本Ⅰ',
    [],
    ['近・現代アート概論'],
    ['芸術と文化資本Ⅱ']
  ),
  new SubjectDetailByName(
    'ネット時代の著作権',
    [],
    ['法学Ⅰ'],
    []
  ),
  new SubjectDetailByName(
    'ジェンダー論',
    [],
    ['社会学Ⅰ'],
    []
  ),
  new SubjectDetailByName(
    'メディア論',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '科学技術と社会',
    [],
    ['社会学Ⅰ'],
    []
  ),
  new SubjectDetailByName(
    '情報社会論',
    [],
    [],
    ['情報社会の総合安全保障', '戦後日本史1', '戦後日本史2', '国際関係論', '民主主義論', 'ゼミ（情報社会の政治学）']
  ),
  new SubjectDetailByName(
    '戦後日本史1',
    [],
    [],
    ['戦後日本史2']
  ),
  new SubjectDetailByName(
    '異文化理解',
    [],
    [],
    ['ゼミ（異文化理解）']
  ),
  new SubjectDetailByName(
    '大学とメディアの人類史',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '社会学Ⅱ',
    [],
    ['社会学Ⅰ'],
    ['社会学Ⅲ']
  ),
  new SubjectDetailByName(
    'マクロ経済学',
    [],
    ['経済入門'],
    ['マクロ経済分析演習', 'ゼミ（経済発展を考える）']
  ),
  new SubjectDetailByName(
    'ミクロ経済学',
    [],
    ['経済入門'],
    []
  ),
  new SubjectDetailByName(
    '企業経営とファイナンス',
    [],
    ['企業経営', '企業経営と会計'],
    ['財務分析演習', '企業価値創造とM＆A']
  ),
  new SubjectDetailByName(
    'デジタル・マーケティング',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'スタートアップ',
    [],
    ['企業経営'],
    ['スタートアップ実践']
  ),
  new SubjectDetailByName(
    '農業とデジタルテクノロジー',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '交渉・合意形成概論',
    [],
    ['意思決定の能力開発'],
    ['交渉・合意形成演習']
  ),
  new SubjectDetailByName(
    'コンテンツ産業論',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゲーム制作論基礎',
    [],
    ['日本のゲーム産業史'],
    ['ゲーム制作論応用']
  ),
  new SubjectDetailByName(
    'キャリアデザインⅡ（仕事理解）',
    [],
    ['キャリアデザインⅠ（自己理解）'],
    ['キャリアデザインⅢ（就活実践）']
  ),
  new SubjectDetailByName(
    'キャリアデザインⅢ（就活実践）',
    [],
    ['キャリアデザインⅡ（仕事理解）'],
    []
  ),
  new SubjectDetailByName(
    '人生設計とお金の管理',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ネットワーク産業論',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'デジタル画像創作論Ⅰ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'デジタル画像創作論Ⅱ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'デジタル画像創作論Ⅲ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '3Dモデリング技術演習',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ジェネラティブアート演習',
    [],
    ['ビジュアルプログラミング', 'Webアプリケーション開発1'],
    []
  ),
  new SubjectDetailByName(
    'インターネットのしくみ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'Javaプログラミング演習',
    [],
    ['Webアプリケーション開発1'],
    []
  ),
  new SubjectDetailByName(
    'Webセキュリティ演習',
    [],
    ['Webアプリケーション開発3'],
    []
  ),
  new SubjectDetailByName(
    'デジタルイラスト演習基礎',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'AIアルゴリズム実践',
    [],
    ['Pythonプログラミング', '機械学習概論'],
    ['マーケティング × データサイエンス', 'データサイエンス実践Ⅱ（モデリング）']
  ),
  new SubjectDetailByName(
    '統計学展望',
    [],
    ['数学の方法', '解析学1'],
    ['データサイエンス実践Ⅱ（モデリング）', '統計数理の方法']
  ),
  new SubjectDetailByName(
    'マーケティング × データサイエンス',
    [],
    ['データサイエンス概論', '統計学入門'],
    ['データサイエンス実践Ⅱ（モデリング）', 'データサイエンス実践Ⅲ（時系列）']
  ),
  new SubjectDetailByName(
    '数理科学発展演習Ⅱ',
    [],
    ['集合と論理', '距離空間', '数理構造の発見と活用'],
    []
  ),
  new SubjectDetailByName(
    'Inter-universal Teichmüller Theory 2（宇宙際タイヒミューラー理論 2）',
    [],
    ['Inter-universal Teichmüller Theory 1（宇宙際タイヒミューラー理論 1）'],
    ['Inter-universal Teichmüller Theory 3（宇宙際タイヒミューラー理論 3）']
  ),
  new SubjectDetailByName(
    'Inter-universal Teichmüller Theory 3（宇宙際タイヒミューラー理論 3）',
    [],
    ['Inter-universal Teichmüller Theory 2（宇宙際タイヒミューラー理論 2）'],
    ['Inter-universal Teichmüller Theory 4（宇宙際タイヒミューラー理論 4）']
  ),
  new SubjectDetailByName(
    '政治を超える哲学Ⅱ',
    [],
    ['政治を超える哲学Ⅰ'],
    []
  ),
  new SubjectDetailByName(
    '社会で活きる囲碁論',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '心理学実験・調査演習',
    [],
    ['心理学'],
    ['ゼミ（心の科学）']
  ),
  new SubjectDetailByName(
    'WEBコミック演習',
    [],
    ['マンガ絵コンテから学ぶ視覚表現'],
    []
  ),
  new SubjectDetailByName(
    'こころの成り立ちとメンタルヘルス',
    [],
    ['心理学'],
    ['ゼミ（心の科学）']
  ),
  new SubjectDetailByName(
    'ウェルビーイングをデザインする',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '社会学Ⅲ',
    [],
    ['社会学Ⅱ'],
    ['ゼミ（社会学）']
  ),
  new SubjectDetailByName(
    '現代スポーツ構造分析',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'SFから考える未来ビジョン',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '現代社会理論',
    [],
    ['社会学Ⅱ'],
    []
  ),
  new SubjectDetailByName(
    '未来社会デザイン論',
    [],
    ['人新世の人類学', '共創地球論'],
    []
  ),
  new SubjectDetailByName(
    '音楽と社会',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '子どもと地域づくり',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'コラボレーション・クリエイティブ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '現代資本主義論',
    [],
    ['マルクス経済学'],
    []
  ),
  new SubjectDetailByName(
    'メディアで検証する未来の作り方',
    [],
    ['IT産業史'],
    []
  ),
  new SubjectDetailByName(
    'アニメのクオリティー管理と商品性',
    [],
    ['アニメ産業史'],
    ['ゼミ（アニメ作品の分析メソッド）', 'アニメ産業に関わる仕事']
  ),
  new SubjectDetailByName(
    'マンガの企画立案とプロデュース論',
    [],
    ['マンガ産業史'],
    []
  ),
  new SubjectDetailByName(
    '文化資源とメタバース',
    [],
    ['コンテンツ産業論'],
    ['ゼミ（文化資源アーカイブとメタバース）']
  ),
  new SubjectDetailByName(
    '文化資源のデジタルアーカイブ',
    [],
    ['コンテンツ産業論'],
    ['ゼミ（文化資源アーカイブとメタバース）']
  ),
  new SubjectDetailByName(
    '英語コミュニケーションⅢ（プレゼンテーション）',
    [],
    ['英語コミュニケーションⅠ（発音）', '英語コミュニケーションⅡ（日常会話）'],
    ['英語コミュニケーションⅣ（ビジネス会話）']
  ),
  new SubjectDetailByName(
    '英語コミュニケーションⅣ（ビジネス会話）',
    [],
    ['英語コミュニケーションⅠ（発音）', '英語コミュニケーションⅡ（日常会話）', '英語コミュニケーションⅢ（プレゼンテーション）'],
    []
  ),
  new SubjectDetailByName(
    'デジタルトランスフォーメーション時代の働き方',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '生命科学論ー動的平衡の視点から「生命とはなにか」を哲学するー',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '日本政治外交史',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとデザインA',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとデザインB',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとデザインC',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとデザインD',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'クラウドコンピューティング技術',
    [],
    ['Webアプリケーション開発4'],
    []
  ),
  new SubjectDetailByName(
    '関数型プログラミング',
    [],
    ['オブジェクト指向プログラミング'],
    ['並行処理プログラミング']
  ),
  new SubjectDetailByName(
    'オートマトンと形式言語理論',
    [],
    ['コンピューターサイエンス概論'],
    []
  ),
  new SubjectDetailByName(
    '暗号技術とその応用',
    [],
    ['情報セキュリティ概論'],
    []
  ),
  new SubjectDetailByName(
    'データベース運用実践',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '並行処理プログラミング',
    [],
    ['関数型プログラミング'],
    []
  ),
  new SubjectDetailByName(
    '画像処理論',
    [],
    ['コンピューターサイエンス概論'],
    []
  ),
  new SubjectDetailByName(
    '論理回路概論',
    [],
    ['コンピュータ概論'],
    []
  ),
  new SubjectDetailByName(
    'データサイエンス実践Ⅰ（アンケート）',
    [],
    ['データサイエンス概論', '統計学入門', 'R言語プログラミング'],
    ['自然言語処理の方法']
  ),
  new SubjectDetailByName(
    'データサイエンス実践Ⅱ（モデリング）',
    [],
    ['Pythonプログラミング', '機械学習概論', '線形代数1', '解析学1'],
    []
  ),
  new SubjectDetailByName(
    'データサイエンス実践Ⅲ（時系列）',
    [],
    ['データサイエンス概論', '統計学入門', 'Pythonプログラミング', '機械学習概論', '線形代数1', '解析学1'],
    []
  ),
  new SubjectDetailByName(
    'ディープラーニング3',
    [],
    ['ディープラーニング2'],
    []
  ),
  new SubjectDetailByName(
    'ビッグデータ分析実践',
    [],
    ['データサイエンス概論', 'ビッグデータ分析概論'],
    []
  ),
  new SubjectDetailByName(
    '群論',
    ['線形代数1', '線形代数2'],
    [],
    ['環論', 'ガロア理論']
  ),
  new SubjectDetailByName(
    '位相空間',
    ['距離空間'],
    [],
    ['多様体', 'トポロジー']
  ),
  new SubjectDetailByName(
    '多様体',
    [],
    ['線形代数2', '解析学3', '位相空間'],
    ['ゼミ（数理科学特論ゼミⅠ）', 'ゼミ（数理科学特論ゼミⅡ）', 'ゼミ（数理科学特論ゼミⅢ）', 'ゼミ（数理科学特論ゼミⅣ）']
  ),
  new SubjectDetailByName(
    '圏論',
    [],
    ['数理構造の発見と活用', '集合と論理'],
    ['ゼミ（数理科学特論ゼミⅠ）', 'ゼミ（数理科学特論ゼミⅡ）', 'ゼミ（数理科学特論ゼミⅢ）', 'ゼミ（数理科学特論ゼミⅣ）']
  ),
  new SubjectDetailByName(
    '数理統計',
    [],
    ['統計学入門', '線形代数2', '解析学2'],
    ['計算機実験で学ぶ確率とモンテカルロ法', 'ゼミ（数理科学特論ゼミⅠ）', 'ゼミ（数理科学特論ゼミⅡ）', 'ゼミ（数理科学特論ゼミⅢ）', 'ゼミ（数理科学特論ゼミⅣ）', 'ゼミ（量子科学技術）']
  ),
  new SubjectDetailByName(
    '電磁気学',
    ['解析学2', '力学'],
    [],
    ['量子力学', '熱統計力学']
  ),
  new SubjectDetailByName(
    '量子力学',
    ['線形代数2', '解析学2'],
    [],
    ['量子コンピュータ演習', 'ゼミ（量子科学技術）']
  ),
  new SubjectDetailByName(
    '熱統計力学',
    ['解析学2', '力学'],
    [],
    ['ゼミ（量子科学技術）']
  ),
  new SubjectDetailByName(
    '統計学を哲学する',
    [],
    ['統計学入門'],
    ['統計学展望', 'AI時代の科学と哲学']
  ),
  new SubjectDetailByName(
    '日本大衆文化史',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '法学Ⅱ',
    [],
    ['法学Ⅰ'],
    ['ゼミ（多様化する家族）']
  ),
  new SubjectDetailByName(
    '戦後日本史2',
    [],
    ['戦後日本史1'],
    []
  ),
  new SubjectDetailByName(
    'ゲーム制作論応用',
    [],
    ['日本のゲーム産業史', 'ゲーム制作論基礎'],
    []
  ),
  new SubjectDetailByName(
    'デジタル画像活用Ⅰ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'デジタル画像活用Ⅱ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゲームプログラミング演習',
    [],
    ['Webアプリケーション開発4'],
    []
  ),
  new SubjectDetailByName(
    'チームプログラミング演習',
    [],
    ['Linux概論', 'Webアプリケーション開発4'],
    []
  ),
  new SubjectDetailByName(
    'プロジェクトマネジメント応用',
    [],
    ['プロジェクトマネジメント概論'],
    []
  ),
  new SubjectDetailByName(
    'Webアプリケーション開発演習',
    [],
    ['Linux概論', 'データベース運用実践', 'Webアプリケーション開発4'],
    []
  ),
  new SubjectDetailByName(
    '動画クリエイター技術演習',
    [],
    ['デジタルツールの使い方'],
    []
  ),
  new SubjectDetailByName(
    'Webデザイン演習',
    [],
    ['デジタルツールの使い方'],
    []
  ),
  new SubjectDetailByName(
    'デジタルイラスト演習発展',
    [],
    ['デジタルイラスト演習基礎'],
    []
  ),
  new SubjectDetailByName(
    '共創場デザイン演習',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '統計数理の方法',
    [],
    ['計算機実験で学ぶ確率とモンテカルロ法', '統計学展望', '線形代数1', '数学の方法', '解析学1', '解析学2'],
    ['数理統計']
  ),
  new SubjectDetailByName(
    '自然言語処理の方法',
    [],
    ['統計学入門', 'データサイエンス実践Ⅰ（アンケート）'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（インターネットのしくみ（応用））',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（質的データ分析&エージェントシミュレーション）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（情報セキュリティ）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（AIデータサイエンス価値創造ゼミⅠ）',
    [],
    ['ディープラーニング1', 'ディープラーニング2', 'ディープラーニング3'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（AIデータサイエンス価値創造ゼミⅡ）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '環論',
    [],
    ['群論'],
    ['ガロア理論']
  ),
  new SubjectDetailByName(
    '組合せ論',
    ['線形代数2', '集合と論理'],
    [],
    ['ガロア理論', 'ゼミ（数理科学特論ゼミⅠ）', 'ゼミ（数理科学特論ゼミⅡ）', 'ゼミ（数理科学特論ゼミⅢ）', 'ゼミ（数理科学特論ゼミⅣ）']
  ),
  new SubjectDetailByName(
    'トポロジー',
    ['線形代数2', '解析学2', '集合と論理', '群論', '位相空間'],
    [],
    ['ゼミ（数理科学特論ゼミⅠ）', 'ゼミ（数理科学特論ゼミⅡ）', 'ゼミ（数理科学特論ゼミⅢ）', 'ゼミ（数理科学特論ゼミⅣ）']
  ),
  new SubjectDetailByName(
    '積分と測度',
    [],
    ['線形代数2', '解析学3', '位相空間'],
    ['ゼミ（数理科学特論ゼミⅠ）', 'ゼミ（数理科学特論ゼミⅡ）', 'ゼミ（数理科学特論ゼミⅢ）', 'ゼミ（数理科学特論ゼミⅣ）']
  ),
  new SubjectDetailByName(
    'Inter-universal Teichmüller Theory 4（宇宙際タイヒミューラー理論 4）',
    [],
    ['Inter-universal Teichmüller Theory 3（宇宙際タイヒミューラー理論 3）'],
    []
  ),
  new SubjectDetailByName(
    '量子コンピュータ演習',
    ['線形代数1'],
    [],
    ['ゼミ（量子科学技術）']
  ),
  new SubjectDetailByName(
    'Wolfram言語で学ぶ科学計算',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '芸術と文化資本Ⅱ',
    [],
    ['芸術と文化資本Ⅰ'],
    []
  ),
  new SubjectDetailByName(
    '日本文学Ⅲ',
    [],
    ['日本文学Ⅱ'],
    []
  ),
  new SubjectDetailByName(
    '文化人類学Ⅲ',
    [],
    ['文化人類学Ⅱ'],
    []
  ),
  new SubjectDetailByName(
    'AI時代の科学と哲学',
    [],
    ['科学哲学', '統計学を哲学する'],
    ['ゼミ（数理哲学）']
  ),
  new SubjectDetailByName(
    'フィールドワークで学ぶ宗教思想史',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（心の科学）',
    [],
    ['心理学実験・調査演習'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（物語創作と物語の構造分析）',
    [],
    ['リテラシーと応⽤のための物語理論'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（トークイベントをつくる）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'スマート田舎のススメ',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    '課題解決と改革のリーダーシップ',
    [],
    ['企業経営'],
    []
  ),
  new SubjectDetailByName(
    '民主主義論',
    [],
    ['情報社会の総合安全保障', '情報社会論'],
    ['戦後日本史1', '戦後日本史2', 'ゼミ（情報社会の政治学）', '国際関係論']
  ),
  new SubjectDetailByName(
    'ゼミ（多様化する家族）',
    [],
    ['法学Ⅰ', '法学Ⅱ'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（情報社会の政治学）',
    [],
    ['情報社会の総合安全保障', '情報社会論', '民主主義論', '国際関係論'],
    []
  ),
  new SubjectDetailByName(
    'マクロ経済分析演習',
    [],
    ['マクロ経済学'],
    ['ゼミ（経済発展を考える）']
  ),
  new SubjectDetailByName(
    '課題解決のための計量経済分析',
    [],
    ['経済入門', 'R言語プログラミング'],
    []
  ),
  new SubjectDetailByName(
    '事例から学ぶ統計学',
    [],
    ['経済入門'],
    ['ゼミ（計量経済）']
  ),
  new SubjectDetailByName(
    '財務分析演習',
    [],
    ['企業経営とファイナンス'],
    ['ゼミ（幸福曲線）']
  ),
  new SubjectDetailByName(
    '企業価値創造とM＆A',
    [],
    ['企業経営とファイナンス'],
    ['ゼミ（幸福曲線）']
  ),
  new SubjectDetailByName(
    '交渉・合意形成演習',
    [],
    ['意思決定の能力開発', '交渉・合意形成概論'],
    ['ゼミ（意思決定研究と実践）']
  ),
  new SubjectDetailByName(
    'ゼミ（地域づくり新事業ワークショップ）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（文化資源アーカイブとメタバース）',
    [],
    ['文化資源とメタバース'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（アニメ作品の分析メソッド）',
    [],
    ['アニメ産業史', 'アニメのクオリティー管理と商品性', 'アニメ産業に関わる仕事'],
    []
  ),
  new SubjectDetailByName(
    'アニメ産業に関わる仕事',
    [],
    ['アニメ産業史', 'アニメのクオリティー管理と商品性'],
    ['ゼミ（アニメ作品の分析メソッド）']
  ),
  new SubjectDetailByName(
    'イラストとその活用A',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとその活用B',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとその活用C',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'イラストとその活用D',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（メディアアート）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ガロア理論',
    ['群論', '環論'],
    [],
    []
  ),
  new SubjectDetailByName(
    '数理論理学',
    [],
    ['集合と論理', '記号論理'],
    []
  ),
  new SubjectDetailByName(
    '量子からはじまる確率論',
    [],
    ['数理構造の発見と活用', '積分と測度'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（数理科学特論ゼミⅠ）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（数理科学特論ゼミⅡ）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（数理科学特論ゼミⅢ）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（数理科学特論ゼミⅣ）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（量子科学技術）',
    [],
    ['量子力学', '量子コンピュータ演習'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（展覧会のつくりかた）',
    [],
    [],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（文芸批評論）',
    [],
    ['日本文学Ⅰ', '日本文学Ⅱ', '日本文学Ⅲ'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（ファン文化論を捉えなおすための参加型文化論）',
    [],
    ['文化人類学Ⅲ'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（数理哲学）',
    [],
    ['集合と論理', '哲学概論', '科学哲学'],
    []
  ),
  new SubjectDetailByName(
    '国際関係論',
    [],
    ['情報社会の総合安全保障', '情報社会論'],
    ['戦後日本史1', '戦後日本史2', '民主主義論']
  ),
  new SubjectDetailByName(
    'ゼミ（社会学）',
    [],
    ['社会学Ⅱ'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（意思決定研究と実践）',
    [],
    ['意思決定の能力開発', '交渉・合意形成概論', '交渉・合意形成演習'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（異文化理解）',
    [],
    ['異文化理解'],
    []
  ),
  new SubjectDetailByName(
    'スタートアップ実践',
    [],
    ['スタートアップ'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（ビジネスモデル分析）',
    [],
    ['企業経営'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（経済発展を考える）',
    [],
    ['マクロ経済学', 'マクロ経済分析演習'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（計量経済）',
    [],
    ['経済入門', 'ミクロ経済学', '事例から学ぶ統計学'],
    []
  ),
  new SubjectDetailByName(
    'ゼミ（幸福曲線）',
    [],
    ['企業経営とファイナンス', '財務分析演習', '企業価値創造とM＆A'],
    []
  ),
  new SubjectDetailByName(
    'プロジェクト実践',
    [],
    [],
    []
  )
];
